app/views/users/show.html.erb

Photo time!
            <% @user.photos.each do |p| %>
---
SELECT "photos".* FROM "photos" WHERE "photos"."user_id" = $1  [["user_id", 20]]