app/controllers/photos_controller.rb

  def new
    #added @user due to nested routes
    @user = User.find(params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 13]]

  def create
    #Find our user that we should attach to.
    if current_user != nil
      #this only works if a user is logged in. If no one is logged in it barfs.
      @photo = current_user.photos.new(photo_params)
      #or the standard create:
      #@photo = Photo.create(photo_params)
      if @photo.save
---
INSERT INTO "photos" ("image_file_name", "image_content_type", "image_file_size", "image_updated_at", "photo_date", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"