app/controllers/users_controller.rb

   def update
     user = User.find(params[:id])
    # respond_to do |format|
      if user.update(user_params) #could also use update_attributes method
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 9]]
UPDATE "users" SET "first_name" = $1, "last_name" = $2, "bio_text" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["first_name", "Lorin"], ["last_name", "T "], ["bio_text", "Instructor Extraordinaire!"], ["updated_at", "2015-02-17 04:37:34.508884"], ["id", 4]]

  def create
    user = User.new((params.require(:user).permit(:email, :password, :password_confirmation, :first_name, :last_name, :bio_text, :avatar)))
    #respond_to do |format|
      if user.save
---
INSERT INTO "users" ("email", "password_digest", "first_name", "last_name", "bio_text", "avatar_file_name", "avatar_content_type", "avatar_file_size", "avatar_updated_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"